In [4]:
import pandas as pd
import numpy as np

In [5]:
series = pd.Series([7, 15, 4, 4, 7, 4], index=[
                   'r1', 'r2', 'r3', 'r4', 'r5', 'r6'])
series

r1     7
r2    15
r3     4
r4     4
r5     7
r6     4
dtype: int64

In [6]:
print(f"{series.r2=}")
print(f"\n {series[1]=}")
print(f"\n {series.values=}")
print(f"\n {series.index=}")
print(f"\n {series.value_counts=}")

series.r2=15

 series[1]=15

 series.values=array([ 7, 15,  4,  4,  7,  4], dtype=int64)

 series.index=Index(['r1', 'r2', 'r3', 'r4', 'r5', 'r6'], dtype='object')

 series.value_counts=<bound method IndexOpsMixin.value_counts of r1     7
r2    15
r3     4
r4     4
r5     7
r6     4
dtype: int64>

In [7]:
df = pd.DataFrame([[1, 8], [3, 4], [5, 9], [7, 2]], index=[
                  'A1', 'A2', 'A3', 'A4'], columns=['B1', 'B2'])
df

    B1  B2
A1   1   8
A2   3   4
A3   5   9
A4   7   2

In [8]:
print(f"df[:3]:\n {df[:3]}")
print(f"\n df['B2']:\n{df['B2']}")

df[:3]:
     B1  B2
A1   1   8
A2   3   4
A3   5   9

 df['B2']:
A1    8
A2    4
A3    9
A4    2
Name: B2, dtype: int64

In [9]:
df.values

array([[1, 8],
       [3, 4],
       [5, 9],
       [7, 2]], dtype=int64)

In [10]:
df[df < 5]

     B1   B2
A1  1.0  NaN
A2  3.0  4.0
A3  NaN  NaN
A4  NaN  2.0

In [11]:
df.head()

    B1  B2
A1   1   8
A2   3   4
A3   5   9
A4   7   2

In [12]:
df.tail(2)

    B1  B2
A3   5   9
A4   7   2

In [13]:
df.index

Index(['A1', 'A2', 'A3', 'A4'], dtype='object')

In [14]:
df.columns

Index(['B1', 'B2'], dtype='object')

In [15]:
df.T

    A1  A2  A3  A4
B1   1   3   5   7
B2   8   4   9   2

In [16]:
df.drop('A3', axis=0)

    B1  B2
A1   1   8
A2   3   4
A4   7   2

In [17]:
df.drop('B2', axis=1)

    B1
A1   1
A2   3
A3   5
A4   7

In [18]:
df.describe()

             B1        B2
count  4.000000  4.000000
mean   4.000000  5.750000
std    2.581989  3.304038
min    1.000000  2.000000
25%    2.500000  3.500000
50%    4.000000  6.000000
75%    5.500000  8.250000
max    7.000000  9.000000

In [19]:
df = pd.DataFrame({'x1': [1, 5],  'x2': [-1, 4], 'x3': [5, 6]})
df

   x1  x2  x3
0   1  -1   5
1   5   4   6

In [20]:
df.sort_index(axis=1)

   x1  x2  x3
0   1  -1   5
1   5   4   6

In [21]:
df.sort_index(axis=0, ascending=False)

   x1  x2  x3
1   5   4   6
0   1  -1   5

In [24]:
df.sort_values(by='x3',ascending=False)

   x1  x2  x3
1   5   4   6
0   1  -1   5

In [25]:
df[df.x3 < 30]

   x1  x2  x3
0   1  -1   5
1   5   4   6

In [27]:
df.iloc[1][1]

4

In [28]:
df.iloc[1]['x3']

6